#!encoding=utf8
from collections import OrderedDict

# 漏洞类型
VUL_TYPE = {"10": "SQL注入漏洞",
            "15": "XSS跨站漏洞",
            "20": "命令执行漏洞",
            "25": "代码执行漏洞",
            "30": "文件包含漏洞",
            "35": "任意文件操作",
            "40": "权限绕过",
            "45": "逻辑漏洞",
            "50": "存在后门",
            "55": "信息泄露",
            "60": "文件上传",
            "65": "弱口令",
            "70": "威胁情报",
            "75": "其他"
        }

# 漏洞等级
VUL_LEVEL = {"10": "严重", "20": "高危", "30": "中危", "40": "低危"}

# 漏洞状态
VUL_STATUS = {"10": "待审核", "20": "已忽略", "30": "已驳回", "35": "暂不处理", "40": "已确认", "50": "修复中", "55": "复测中", "60": "已完成"}


VUL_ACTION = OrderedDict()
VUL_ACTION["/auditing/confirm"] = "确认"
VUL_ACTION["/auditing/ignore"] = "忽略"
VUL_ACTION["/auditing/reject"] = "驳回"
VUL_ACTION["/auditing/undo"] = "暂不处理"

# ACTION = {"确认 comfirm": 40, "已知悉(开始修复)": 50, "申请复测": 55, "提交复测结果": "60/40"}

# 漏洞来源
VUL_SOURCE = {"10": "安全部", "20":"CESRC", "30": "YISRC", "40":"公众平台", "50": "合作伙伴"}

# 漏洞层面
VUL_LAYER = {"10": "代码", "20":"运维"}

# 资产等级
ASSET_LEVEL = {"10": "一级", "20": "二级", "30": "三级", "40": "其他"}
# 资产类型
ASSET_TYPE = {"10": "域名", "20": "IP"}
ASSET_APP_TYPE = {"10": "服务器", "20": "数据库", "30": "Nginx"}

# 应用类型
APP_TYPE = {"10": "APP", "20": "WEB应用", "30": "APP和WEB应用"}

# 应用安全等级
APP_SEC_LEVEL = {"10": "安全一级", "20": "安全二级", "30": "安全三级", "40": "其他"}

# 应用状态
APP_STATUS = {"10": "线上", "20": "上线前", "30": "下线"}

# 应用敏感数据条数
APP_SENSITIVE_DATA_COUNT = {"10": "几十", "20": "几百", "30": "几千", "40": "几万"}

# 应用宕机时常
APP_DOWNTIME = {"10": "几分钟", "20": "几十分钟", "30": "几小时", "40": "几天"}

# 认证类型
AUTH_MODE = ["LDAP"]

# 关联权限
RELATE_ACCESS = {"action.assets.AssetAdd": ["action.group.GroupList"]}

# 扩展类型
EXTENSION_TYPE = {"0": "安全扫描", "1": "资产收集", "2": "通知", "3":"授权", "4":"持续集成", "5":"事件响应", "6":"工作流", "7": "安全验证"}

#安全类型测试
SEC_UTEST_TYPE = {"0": "手动测试", "1": "外包测试", "2": "扫描器测试", "3": "脚本测试"}

# 定时任务状态
CRONTAB_STATUS = {"0": "未执行", "1": "执行中", "2": "执行完毕"}

# 定时任务管理类型
CRONTAB_RELATE = ["SYSTEM", "APP", "ASSET"]

